export type RaionIso =
  | 'UA0102'
  | 'UA0104'
  | 'UA0106'
  | 'UA0108'
  | 'UA0110'
  | 'UA0112'
  | 'UA0114'
  | 'UA0116'
  | 'UA0118'
  | 'UA0120'
  | 'UA0502'
  | 'UA0504'
  | 'UA0506'
  | 'UA0508'
  | 'UA0510'
  | 'UA0512'
  | 'UA0702'
  | 'UA0704'
  | 'UA0706'
  | 'UA0708'
  | 'UA1202'
  | 'UA1204'
  | 'UA1206'
  | 'UA1208'
  | 'UA1210'
  | 'UA1212'
  | 'UA1214'
  | 'UA1402'
  | 'UA1404'
  | 'UA1406'
  | 'UA1408'
  | 'UA1410'
  | 'UA1412'
  | 'UA1414'
  | 'UA1416'
  | 'UA1802'
  | 'UA1804'
  | 'UA1806'
  | 'UA1808'
  | 'UA2102'
  | 'UA2104'
  | 'UA2106'
  | 'UA2108'
  | 'UA2110'
  | 'UA2112'
  | 'UA2302'
  | 'UA2304'
  | 'UA2306'
  | 'UA2308'
  | 'UA2310'
  | 'UA2602'
  | 'UA2604'
  | 'UA2606'
  | 'UA2608'
  | 'UA2610'
  | 'UA2612'
  | 'UA3200'
  | 'UA3202'
  | 'UA3204'
  | 'UA3206'
  | 'UA3208'
  | 'UA3210'
  | 'UA3212'
  | 'UA3214'
  | 'UA3502'
  | 'UA3504'
  | 'UA3506'
  | 'UA3508'
  | 'UA4402'
  | 'UA4404'
  | 'UA4406'
  | 'UA4408'
  | 'UA4410'
  | 'UA4412'
  | 'UA4414'
  | 'UA4416'
  | 'UA4602'
  | 'UA4604'
  | 'UA4606'
  | 'UA4608'
  | 'UA4610'
  | 'UA4612'
  | 'UA4614'
  | 'UA4802'
  | 'UA4804'
  | 'UA4806'
  | 'UA4808'
  | 'UA5102'
  | 'UA5104'
  | 'UA5106'
  | 'UA5108'
  | 'UA5110'
  | 'UA5112'
  | 'UA5114'
  | 'UA5302'
  | 'UA5304'
  | 'UA5306'
  | 'UA5308'
  | 'UA5602'
  | 'UA5604'
  | 'UA5606'
  | 'UA5608'
  | 'UA5902'
  | 'UA5904'
  | 'UA5906'
  | 'UA5908'
  | 'UA5910'
  | 'UA6102'
  | 'UA6104'
  | 'UA6106'
  | 'UA6302'
  | 'UA6304'
  | 'UA6306'
  | 'UA6308'
  | 'UA6310'
  | 'UA6312'
  | 'UA6314'
  | 'UA6502'
  | 'UA6504'
  | 'UA6506'
  | 'UA6508'
  | 'UA6510'
  | 'UA6802'
  | 'UA6804'
  | 'UA6806'
  | 'UA7102'
  | 'UA7104'
  | 'UA7106'
  | 'UA7108'
  | 'UA7302'
  | 'UA7304'
  | 'UA7306'
  | 'UA7402'
  | 'UA7404'
  | 'UA7406'
  | 'UA7408'
  | 'UA7410'
  | 'UA8000'
  | 'UA8500'
export const raion: Record<RaionIso, [string, string, [number, number]]> = {
  UA0102: ['Bakhchysaraiskyi', 'Бахчисарайський', [44.65944872, 33.83442735]],
  UA0104: ['Bilohirskyi', 'Білогірський', [45.0647836, 34.57573835]],
  UA0106: ['Dzhankoiskyi', 'Джанкойський', [45.73860446, 34.38241753]],
  UA0108: ['Yevpatoriiskyi', 'Євпаторійський', [45.35118518, 33.21824533]],
  UA0110: ['Kerchenskyi', 'Керченський', [45.25187091, 36.02401743]],
  UA0112: ['Kurmanskyi', 'Курманський', [45.49201626, 34.06314049]],
  UA0114: ['Perekopskyi', 'Перекопський', [45.81612117, 33.62788292]],
  UA0116: ['Simferopolskyi', 'Сімферопольський', [44.98377359, 34.0597552]],
  UA0118: ['Feodosiiskyi', 'Феодосійський', [45.181079, 35.10586732]],
  UA0120: ['Yaltynskyi', 'Ялтинський', [44.6637554, 34.33163013]],
  UA0502: ['Vinnytskyi', 'Вінницький', [49.17068567, 28.84011642]],
  UA0504: ['Haisynskyi', 'Гайсинський', [48.55752077, 29.51830312]],
  UA0506: ['Zhmerynskyi', 'Жмеринський', [48.9495091, 27.91719775]],
  UA0508: ['Mohyliv-Podilskyi', 'Могилів-Подільський', [48.49386503, 27.98241239]],
  UA0510: ['Tulchynskyi', 'Тульчинський', [48.56232592, 28.6777701]],
  UA0512: ['Khmilnytskyi', 'Хмільницький', [49.60736049, 28.41207228]],
  UA0702: ['Volodymyrskyi', 'Володимирський', [50.76634325, 24.43152613]],
  UA0704: ['Kamin-Kashyrskyi', 'Камінь-Каширський', [51.58008851, 25.17547994]],
  UA0706: ['Kovelskyi', 'Ковельський', [51.31632028, 24.38455426]],
  UA0708: ['Lutskyi', 'Луцький', [50.84740093, 25.33175307]],
  UA1202: ['Dniprovskyi', 'Дніпровський', [48.39354196, 34.9264514]],
  UA1204: ['Kamianskyi', "Кам'янський", [48.47979768, 34.11543586]],
  UA1206: ['Kryvorizkyi', 'Криворізький', [47.88744345, 33.59862883]],
  UA1208: ['Nikopolskyi', 'Нікопольський', [47.74592723, 34.4731578]],
  UA1210: ['Samarivskyi', 'Самарівський', [48.86936446, 35.21237659]],
  UA1212: ['Pavlohradskyi', 'Павлоградський', [48.63746356, 35.91312079]],
  UA1214: ['Synelnykivskyi', 'Синельниківський', [48.2086295, 36.20935066]],
  UA1402: ['Bakhmutskyi', 'Бахмутський', [48.64956395, 38.0865077]],
  UA1404: ['Volnovaskyi', 'Волноваський', [47.67123837, 37.19036821]],
  UA1406: ['Horlivskyi', 'Горлівський', [48.14620586, 38.43945565]],
  UA1408: ['Donetskyi', 'Донецький', [47.9076047, 38.2045138]],
  UA1410: ['Kalmiuskyi', 'Кальміуський', [47.56321535, 38.08355608]],
  UA1412: ['Kramatorskyi', 'Краматорський', [48.76802362, 37.5166006]],
  UA1414: ['Mariupolskyi', 'Маріупольський', [47.18444513, 37.37040629]],
  UA1416: ['Pokrovskyi', 'Покровський', [48.22403863, 37.3127844]],
  UA1802: ['Berdychivskyi', 'Бердичівський', [49.95780039, 28.81150805]],
  UA1804: ['Zhytomyrskyi', 'Житомирський', [50.35454199, 28.65700327]],
  UA1806: ['Korostenskyi', 'Коростенський', [51.14095994, 28.61069778]],
  UA1808: ['Zviahelskyi', 'Звягельський', [50.64488876, 27.69776752]],
  UA2102: ['Berehivskyi', 'Берегівський', [48.18423218, 22.83322903]],
  UA2104: ['Mukachivskyi', 'Мукачівський', [48.55052046, 22.88805633]],
  UA2106: ['Rakhivskyi', 'Рахівський', [48.11950191, 24.26066722]],
  UA2108: ['Tiachivskyi', 'Тячівський', [48.24745654, 23.80920592]],
  UA2110: ['Uzhhorodskyi', 'Ужгородський', [48.73923237, 22.57006719]],
  UA2112: ['Khustskyi', 'Хустський', [48.41068549, 23.39856185]],
  UA2302: ['Berdianskyi', 'Бердянський', [46.93839798, 36.48300476]],
  UA2304: ['Vasylivskyi', 'Василівський', [47.33290308, 35.03707988]],
  UA2306: ['Zaporizkyi', 'Запорізький', [47.86525926, 35.43090242]],
  UA2308: ['Melitopolskyi', 'Мелітопольський', [46.79319931, 35.29521572]],
  UA2310: ['Polohivskyi', 'Пологівський', [47.51848484, 36.29141448]],
  UA2602: ['Verkhovynskyi', 'Верховинський', [48.02917829, 24.80094214]],
  UA2604: ['Ivano-Frankivskyi', 'Івано-Франківський', [48.93855208, 24.73729441]],
  UA2606: ['Kaluskyi', 'Калуський', [48.86505418, 23.99968951]],
  UA2608: ['Kolomyiskyi', 'Коломийський', [48.54360917, 25.21714609]],
  UA2610: ['Kosivskyi', 'Косівський', [48.3215473, 24.98180715]],
  UA2612: ['Nadvirnianskyi', 'Надвірнянський', [48.47123981, 24.5180657]],
  UA3200: ['Chornobyl Exclusion Zone', 'Чорнобильська зона відчуження', [51.31758765, 29.96868514]],
  UA3202: ['Bilotserkivskyi', 'Білоцерківський', [49.62882153, 30.07687697]],
  UA3204: ['Boryspilskyi', 'Бориспільський', [50.0812768, 31.45619221]],
  UA3206: ['Brovarskyi', 'Броварський', [50.43915516, 31.36396538]],
  UA3208: ['Buchanskyi', 'Бучанський', [50.54502423, 29.88533488]],
  UA3210: ['Vyshhorodskyi', 'Вишгородський', [50.91997857, 30.08634243]],
  UA3212: ['Obukhivskyi', 'Обухівський', [49.91114904, 30.87558049]],
  UA3214: ['Fastivskyi', 'Фастівський', [50.19513164, 29.9813866]],
  UA3502: ['Holovanivskyi', 'Голованівський', [48.35026385, 30.40213024]],
  UA3504: ['Kropyvnytskyi', 'Кропивницький', [48.41686837, 32.39699619]],
  UA3506: ['Novoukrainskyi', 'Новоукраїнський', [48.47915228, 31.51929225]],
  UA3508: ['Oleksandriiskyi', 'Олександрійський', [48.70695843, 33.22562373]],
  UA4402: ['Alchevskyi', 'Алчевський', [48.52076033, 38.71851255]],
  UA4404: ['Dovzhanskyi', 'Довжанський', [48.11882934, 39.66907445]],
  UA4406: ['Luhanskyi', 'Луганський', [48.44512681, 39.33305475]],
  UA4408: ['Rovenkivskyi', 'Ровеньківський', [48.11477352, 39.07465056]],
  UA4410: ['Svativskyi', 'Сватівський', [49.59561575, 38.37369234]],
  UA4412: ['Siverskodonetskyi', 'Сіверськодонецький', [48.97857997, 38.442686]],
  UA4414: ['Starobilskyi', 'Старобільський', [49.37537685, 39.4105483]],
  UA4416: ['Shchastynskyi', 'Щастинський', [48.88681431, 39.25416109]],
  UA4602: ['Drohobytskyi', 'Дрогобицький', [49.32084165, 23.45371275]],
  UA4604: ['Zolochivskyi', 'Золочівський', [49.9538918, 24.91007919]],
  UA4606: ['Lvivskyi', 'Львівський', [49.78392936, 24.14085213]],
  UA4608: ['Sambirskyi', 'Самбірський', [49.41394427, 22.95064632]],
  UA4610: ['Stryiskyi', 'Стрийський', [49.26289503, 23.96012958]],
  UA4612: ['Sheptytskyi', 'Шептицький', [50.35171568, 24.35843493]],
  UA4614: ['Yavorivskyi', 'Яворівський', [49.91243191, 23.393898]],
  UA4802: ['Bashtanskyi', 'Баштанський', [47.40787588, 32.61468652]],
  UA4804: ['Voznesenskyi', 'Вознесенський', [47.5899053, 31.39362419]],
  UA4806: ['Mykolaivskyi', 'Миколаївський', [47.01656188, 31.79912977]],
  UA4808: ['Pervomaiskyi', 'Первомайський', [47.99221576, 30.79598875]],
  UA5102: ['Berezivskyi', 'Березівський', [47.21499627, 30.58705745]],
  UA5104: ['Bilhorod-Dnistrovskyi', 'Білгород-Дністровський', [46.04672982, 29.95730517]],
  UA5106: ['Bolhradskyi', 'Болградський', [45.97541738, 29.22214915]],
  UA5108: ['Izmailskyi', 'Ізмаїльський', [45.52006586, 29.0892477]],
  UA5110: ['Odeskyi', 'Одеський', [46.53308061, 30.53714873]],
  UA5112: ['Podilskyi', 'Подільський', [47.80940247, 29.71359223]],
  UA5114: ['Rozdilnianskyi', 'Роздільнянський', [47.06002189, 29.86076351]],
  UA5302: ['Kremenchutskyi', 'Кременчуцький', [49.35944239, 33.34188042]],
  UA5304: ['Lubenskyi', 'Лубенський', [50.03690899, 32.84039679]],
  UA5306: ['Myrhorodskyi', 'Миргородський', [50.12834042, 33.71862986]],
  UA5308: ['Poltavskyi', 'Полтавський', [49.54235341, 34.57940022]],
  UA5602: ['Varaskyi', 'Вараський', [51.56688593, 25.99857614]],
  UA5604: ['Dubenskyi', 'Дубенський', [50.39014648, 25.57072878]],
  UA5606: ['Rivnenskyi', 'Рівненський', [50.73542318, 26.52692041]],
  UA5608: ['Sarnenskyi', 'Сарненський', [51.4260074, 26.87483247]],
  UA5902: ['Konotopskyi', 'Конотопський', [51.30528859, 33.58513411]],
  UA5904: ['Okhtyrskyi', 'Охтирський', [50.39815189, 34.98312874]],
  UA5906: ['Romenskyi', 'Роменський', [50.73994413, 33.66130086]],
  UA5908: ['Sumskyi', 'Сумський', [50.89984239, 34.70596081]],
  UA5910: ['Shostkynskyi', 'Шосткинський', [51.90670849, 33.76656914]],
  UA6102: ['Kremenetskyi', 'Кременецький', [49.98766972, 25.85379323]],
  UA6104: ['Ternopilskyi', 'Тернопільський', [49.50026957, 25.47397796]],
  UA6106: ['Chortkivskyi', 'Чортківський', [48.93774378, 25.78043705]],
  UA6302: ['Bohodukhivskyi', 'Богодухівський', [50.02418543, 35.40307249]],
  UA6304: ['Iziumskyi', 'Ізюмський', [49.25495202, 37.10883104]],
  UA6306: ['Berestynskyi', 'Берестинський', [49.28414111, 35.66394226]],
  UA6308: ['Kupianskyi', "Куп'янський", [49.83513215, 37.54014953]],
  UA6310: ['Lozivskyi', 'Лозівський', [48.94000649, 36.4013555]],
  UA6312: ['Kharkivskyi', 'Харківський', [49.99409429, 36.18822721]],
  UA6314: ['Chuhuivskyi', 'Чугуївський', [49.85939538, 36.79489235]],
  UA6502: ['Beryslavskyi', 'Бериславський', [47.17207962, 33.45373643]],
  UA6504: ['Henicheskyi', 'Генічеський', [46.49351321, 34.47705328]],
  UA6506: ['Kakhovskyi', 'Каховський', [46.72140625, 33.70547598]],
  UA6508: ['Skadovskyi', 'Скадовський', [46.29618164, 32.51110702]],
  UA6510: ['Khersonskyi', 'Херсонський', [46.66903998, 32.72044599]],
  UA6802: ['Kamianets-Podilskyi', "Кам'янець-Подільський", [48.81347684, 26.80182424]],
  UA6804: ['Khmelnytskyi', 'Хмельницький', [49.46907108, 27.00104962]],
  UA6806: ['Shepetivskyi', 'Шепетівський', [50.1600651, 26.93266181]],
  UA7102: ['Zvenyhorodskyi', 'Звенигородський', [49.05905036, 31.02081448]],
  UA7104: ['Zolotoniskyi', 'Золотоніський', [49.7360329, 32.14679003]],
  UA7106: ['Umanskyi', 'Уманський', [48.91553123, 30.14652415]],
  UA7108: ['Cherkaskyi', 'Черкаський', [49.30875758, 31.85033736]],
  UA7302: ['Vyzhnytskyi', 'Вижницький', [48.06334366, 25.19623038]],
  UA7304: ['Dnistrovskyi', 'Дністровський', [48.46736451, 26.79608468]],
  UA7306: ['Chernivetskyi', 'Чернівецький', [48.2545269, 25.88656555]],
  UA7402: ['Koriukivskyi', 'Корюківський', [51.72752619, 32.22385081]],
  UA7404: ['Nizhynskyi', 'Ніжинський', [51.02162542, 31.82724495]],
  UA7406: ['Novhorod-Siverskyi', 'Новгород-Сіверський', [51.97680668, 32.9814615]],
  UA7408: ['Prylutskyi', 'Прилуцький', [50.69146526, 32.54958241]],
  UA7410: ['Chernihivskyi', 'Чернігівський', [51.4755756, 31.17199199]],
  UA8000: ['Kyiv', 'Київ', [50.42981047, 30.55437837]],
  UA8500: ['Sevastopol', 'Севастополь', [44.5931037, 33.51229933]],
} as const
